[{"id":2,"title":"7 ICONIC HORROR FILMS THAT INSPIRED FEAR STREET PART ONE: 1994","introduction":"FROM SUBTLE HOMAGES TO BLATANT REFERENCES, THESE FILMS HELPED SHAPE NETFLIX'S HORROR TRILOGY BASED ON THE POPULAR R.L. STINE NOVELS.","paragraph1":"SCREAM (1996)\r\n\r\nScream\r\n\r\n\r\nThis is the clearest source of inspiration, as Fear Street: 1994‘s opening scene is ripped from the opening of Wes Craven’s 1996 classic. A killer in a white mask and black cloak stalks a young girl played by a recognizable actress (Stranger Things’ Maya Hawke in this case), and just as we think she’s going to get away, he catches up to her and stabs her to death — but not before the girl manages to remove the mask and reveal the killer is a classmate.\r\n\r\nBeyond the opening scene, the tone of Fear Street: 1994 feels like a continuation of what made Scream so special in terms of self-awareness. The characters in Fear Street may not talk like they know they’re in a horror movie, but they sure are familiar with the tropes of the genre, and they use that to their advantage to avoid easy traps and figure out a way to survive the night.\r\n\r\n","paragraph2":"FRIDAY THE 13TH (1980)\r\n\r\nFriday the 13th\r\n\r\n\r\nThe moment you put the words “summer camp” and “massacre” together, a reference to Friday the 13th is never far behind, and when it comes to Fear Street, there’s no denying it. During the opening credits, we discover that one of the many tragedies to have hit the town of Shadyside took place at a summer camp by a lake, where a masked killer massacred every camper.\r\n\r\nFriday the 13th helped popularize many tropes and rules of the slasher genre, as well as make kids afraid of going to camp. The brief flashbacks we get of the Camp Nightwing Massacre look like direct homages to the original 1980 film and its first sequel, Friday the 13th Part 2, and we can expect even more references to this classic franchise when Fear Street Part Two: 1978 — which focuses specifically on Camp Nightwing — is released.","paragraph3":"HALLOWEEN (1978)\r\n\r\n\r\nWhile its tone and opening scene are reminiscent of Wes Craven’s self-aware masterpiece Scream, Fear Street: 1994′s Skull Mask killer screams John Carpenter’s Halloween for the rest of the movie.\r\n\r\nMichael Myers is perhaps the archetypical silent killer in horror slashers: able to sneak in and out of places without being detected, frequently staring straight at his victims from a distance. In Fear Street, we see the Skull Mask killer stalk the main characters from outside their homes, ominously standing in the middle of the street and staring silently. The moment one character realizes what’s happening and turns around, the killer has already disappeared. The film also borrows from Halloween II later in the story, right down to a few of the jump scares.","conclusion":"Fear Street Part One: 1994, the first of three films debuting on Netflix over the course of three consecutive weeks, owes a lot not only to the Fear Street books, but to classic horror movies that shaped the genre, from Wes Craven classics to a more recent horror hit. So grab your Halloween masks, clutch your crucifixes, and lock your doors, because we’re rounding up the movies that inspired Fear Street: 1994.","username":"Anonymus","date":"2021-07-03"},{"id":2,"title":"Girl with a Pearl Earring","introduction":"Girl with a Pearl Earring, oil painting on canvas (c. 1665) by Dutch artist Johannes Vermeer, one of his most well-known works.","paragraph1":"It depicts an imaginary young woman in exotic dress and a very large pearl earring. The work permanently resides in the Mauritshuis museum in The Hague.\r\nAn observant and deliberate painter, Vermeer produced only 36 known works in his lifetime, while many of his contemporaries completed hundreds. Like his peers, he mostly depicted scenes of ordinary life, later called “genre” painting, often of women at daily tasks. Notable examples included Girl Reading a Letter at an Open Window (c. 1657) and The Music Lesson (c. 1665). He occasionally signed his paintings. While Girl with a Pearl Earring bears “IVMeer,” it is undated. Historians believe Vermeer painted the small piece (17.52 × 15.35 inches [44.5 × 39 cm]) around 1665, during the period in which he executed a group of paintings with a shared pearl motif.","paragraph2":"Girl with a Pearl Earring represents a young woman in a dark shallow space, an intimate setting that draws the viewer’s attention exclusively on her. She wears a blue and gold turban, the titular pearl earring, and a gold jacket with a visible white collar beneath. Unlike many of Vermeer’s subjects, she is not concentrating on a daily chore and unaware of her viewer. Instead, caught in a fleeting moment, she turns her head over her shoulder, meeting the viewer’s gaze with her eyes wide and lips parted as if about to speak. Her enigmatic expression coupled with the mystery of her identity has led some to compare her to the equivocal subject in Leonardo da Vinci’s Mona Lisa (c. 1503–19). Unlike the Mona Lisa, however, Girl with a Pearl Earring is not a portrait but a tronie, a Dutch term for a character or type of person. A young woman might have sat for Vermeer, but the painting is not meant to portray her or any specific individual in the same way that Leonardo’s piece portrayed an existing person (likely Lisa Gherardini, the wife of a Florentine merchant). Vermeer’s subject is a generic young woman in exotic dress, a study in facial expression and costume. The work attests to Vermeer’s technical expertise and interest in representing light. The soft modeling of the subject’s face reveals his mastery of using light rather than line to create form, while the reflection on her lips and on the earring show his concern for representing the effect of light on different surfaces.","paragraph3":"Although now a highly regarded artist, Vermeer was not well known outside of his native city of Delft during his lifetime or in the decades after. Historians credit the 19th-century French critic Étienne-Joseph-Théophile-Thoré (under the pseudonym of William Bürger) for reassessing the artist’s work, which eventually led to Vermeer’s distinguished reputation. Even so, Girl with a Pearl Earring became one of Vermeer’s more famous pieces only around the turn of the 21st century, with the 1995 blockbuster exhibition at the National Gallery of Art in Washington, D.C., and the publication of the best-selling novel Girl with a Pearl Earring by Tracy Chevalier in 1999. The book fashioned the painting’s subject into a housemaid named Griet who works in Vermeer’s home and becomes his paint mixer. It was adapted into an Oscar-nominated film in 2003 starring Scarlett Johansson as the fictional Griet and Colin Firth as Vermeer.","conclusion":"As the Mauritshuis building underwent renovation in 2012, Girl with the Pearl Earring traveled to Japan, Italy, and the United States. It drew crowds in each location, attesting to its now firm place in audience regard. When Girl returned to the Netherlands in 2014, the Mauritshuis announced it would no longer lend out the painting, assuring visitors that the museum’s main attraction would always be in its home.\r\n\r\nThe museum later embarked on a two-year investigation of the artwork, publishing the findings in 2020. Using modern imaging techniques to look at layers beneath the surface, researchers uncovered a green curtain behind the girl and confirmed that she has eyelashes, though they may be hard to discern. Researchers also tested Vermeer’s materials, mapping the sources of his pigments. They discovered that he liberally used the costly ultramarine, a pigment derived from the semiprecious stone lapis lazuli, found only in what is now Afghanistan, for the headscarf. He also used a red pigment derived from an insect living in Mexico and South America for the woman’s lips.","username":"Anonymus","date":"2021-07-03"},{"id":3,"title":"WHAT ARE THE BENEFITS OF TURKEY TAIL MUSHROOMS?","introduction":"The medicinal mushrooms market is set for significant growth. ","paragraph1":"Turkey tail is one of the most popular fungi on the market at present. Also known as Coriolus versicolor or Trametes versicolor, turkey tail mushrooms are linked with various immune-boosting properties. Products such as turkey tail mushroom capsules are often purchased by individuals who want to experience what these fungi can do without being exposed to the taste.","paragraph2":"Turkey Tail Mushrooms Are High In Antioxidants\r\nOxidative stress happens because of an imbalance between free radicals and antioxidants. We require antioxidants to reduce oxidative stress damage, which leads to chronic inflammation and cellular damage. It is a potentially serious issue. Studies such as this one published in Oxidative Medicine and Cellular Longevity in 2016 have found that oxidative stress could increase the risk of conditions such as heart disease.","paragraph3":"This is relevant because of what flavonoid and phenol antioxidants can do. They potentially promote better immune system health by decreasing inflammation. These compounds also increase the production of protective compounds released into the body.","conclusion":"There are lots of brands on the market. However, make sure you only purchase turkey tail mushroom capsules from a reputable source. Companies must show third-party lab reports to prove that their products contain nothing but the highest quality turkey tail extract.","username":"Anonymus","date":"2021-07-04"}]